samuel0117-coder/ojoia-eva/ojoia-eva/ai_system/firmware_esp32_v6.cpp
/**
 * OjoIA ESP32-CAM v6.1
 * - POST /devices/announce (sin user_id, usa firmware_id)
 * - GET /camera/config/{id} (poll cada 30s)
 * - POST /ingest/frame (bytes puros con X-Camera-Id header)
 * - HTTPS con setInsecure() para Cloudflare Tunnel
 * - LED auto/manual, flip, calidad, intervalo
 * - NTP, watchdog, portal cautivo AP
 */

#include <Arduino.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <HTTPClient.h>
#include <Preferences.h>
#include <WebServer.h>
#include <DNSServer.h>
#include <esp_camera.h>
#include <esp_task_wdt.h>
#include <time.h>
#include <esp32-hal-ledc.h>

#define PWDN_GPIO_NUM   32
#define RESET_GPIO_NUM  -1
#define XCLK_GPIO_NUM    0
#define SIOD_GPIO_NUM   26
#define SIOC_GPIO_NUM   27
#define Y9_GPIO_NUM     35
#define Y8_GPIO_NUM     34
#define Y7_GPIO_NUM     39
#define Y6_GPIO_NUM     36
#define Y5_GPIO_NUM     21
#define Y4_GPIO_NUM     19
#define Y3_GPIO_NUM     18
#define Y2_GPIO_NUM      5
#define VSYNC_GPIO_NUM  25
#define HREF_GPIO_NUM   23
#define PCLK_GPIO_NUM   22
#define LED_PIN          4

#define DEFAULT_SERVER_URL  "https://api.ojoia.com.do"
#define DEFAULT_INTERVAL_MS  1000
#define DEFAULT_QUALITY      12
#define DEFAULT_FRAMESIZE    FRAMESIZE_VGA
#define DEFAULT_LED_AUTO     true
#define DEFAULT_LED_BRIGHT   200
#define DEFAULT_H_MIRROR     false
#define DEFAULT_V_FLIP       false

#define LIGHT_LOW_THRESH     80
#define LIGHT_HIGH_THRESH   120
#define CONFIG_POLL_MS      30000
#define WIFI_RECONNECT_MS    2000
#define WIFI_RESTART_MS     60000
#define WATCHDOG_SECS        10
#define AP_PASSWORD "12345678"
#define NTP_SERVER   "pool.ntp.org"
#define NTP_TZ       "America/Santo_Domingo"
#define NTP_TZ_OFF   (-4 * 3600)

Preferences prefs;
WebServer   portalServer(80);
WebServer   configServer(81);
DNSServer   dns;

char ssid[64]         = "";
char password[64]     = "";
char serverUrl[128]   = DEFAULT_SERVER_URL;
char cameraID[20]     = "";

struct CamConfig {
  uint32_t interval_ms  = DEFAULT_INTERVAL_MS;
  uint8_t  quality      = DEFAULT_QUALITY;
  uint8_t  framesize    = DEFAULT_FRAMESIZE;
  bool     led_auto     = DEFAULT_LED_AUTO;
  uint8_t  led_bright   = DEFAULT_LED_BRIGHT;
  bool     h_mirror     = DEFAULT_H_MIRROR;
  bool     v_flip       = DEFAULT_V_FLIP;
  bool     stream_always = true;
} cfg;

bool configured   = false;
bool cameraOK     = false;
bool announced    = false;
bool ntpReady     = false;

unsigned long lastSend      = 0;
unsigned long lastConfigPoll = 0;
unsigned long wifiLostAt    = 0;
String currentSessionId = "";
uint8_t ledCurrent = 0;

bool  loadConfig();
bool  saveConfig(const String& s, const String& p, const String& url);
void  saveCamConfig();
void  loadCamConfig();
bool  connectWiFi();
void  startAP();
bool  initCamera();
void  applyCameraSettings();
void  generateID();
void  announceDevice();
bool  sendFrame(uint8_t* buf, size_t len);
void  setLED(uint8_t brightness);
void  autoLED(camera_fb_t* fb);
uint8_t avgBrightness(camera_fb_t* fb);
void  syncNTP();
String getTimestamp();
void  pollServerConfig();
void  setupConfigServer();

const char PORTAL_HTML[] PROGMEM = R"RAW(<!DOCTYPE html><html lang="es"><head>
<meta charset="UTF-8"><meta name="viewport" content="width=device-width,initial-scale=1">
<title>OjoIA Setup</title>
<style>
:root{--bg:#000;--card:#111;--b:#1c1c1e;--txt:#fff;--mu:#636366;--bl:#0a84ff}
*{box-sizing:border-box;margin:0;padding:0}
body{background:var(--bg);color:var(--txt);font-family:-apple-system,sans-serif;min-height:100vh;display:flex;flex-direction:column;align-items:center;padding:40px 16px}
.logo{font-size:48px;margin-bottom:10px}h1{font-size:22px;font-weight:600}
.tag{font-size:11px;color:var(--mu);margin:4px 0 30px;letter-spacing:1px;text-transform:uppercase}
.card{width:100%;max-width:400px;background:var(--card);border:1px solid var(--b);border-radius:16px;padding:20px}
.nets{max-height:200px;overflow-y:auto;border-radius:10px;background:var(--bg);border:1px solid var(--b);margin-bottom:12px}
.net{display:flex;justify-content:space-between;align-items:center;padding:12px 14px;cursor:pointer;border-bottom:1px solid var(--b);transition:background .15s}
.net:hover{background:#0e0e0e}.net.sel{background:#011126;border-left:3px solid var(--bl)}
.net .nm{font-size:14px}.net .sg{font-size:11px;color:var(--mu)}
.si{font-size:12px;color:var(--bl);min-height:16px;margin-bottom:12px}
lbl{display:block;font-size:10px;color:var(--mu);letter-spacing:.9px;text-transform:uppercase;margin:10px 0 4px}
input{width:100%;padding:12px;border-radius:10px;border:1.5px solid var(--b);background:var(--bg);color:var(--txt);font-size:15px;outline:none}
input:focus{border-color:var(--bl)}
.btn{width:100%;padding:13px;margin-top:18px;border:none;border-radius:12px;font-size:15px;font-weight:600;background:var(--bl);color:#fff;cursor:pointer}
.btn:disabled{opacity:.3;cursor:default}
.ok{text-align:center;padding:20px 0}.ok .ico{font-size:48px;margin-bottom:14px}.ok h2{font-size:20px;margin-bottom:8px}.ok p{font-size:13px;color:var(--mu);line-height:1.6}
</style></head><body>
<div class="logo">👁️</div><h1>OjoIA</h1>
<div class="tag">Configuración de red</div>
<div class="card" id="setupCard">
<div style="font-size:10px;color:var(--mu);letter-spacing:.9px;text-transform:uppercase;margin-bottom:10px">Redes WiFi disponibles</div>
<div class="nets" id="nets"><div style="padding:20px;text-align:center;color:var(--mu);font-size:13px">Buscando...</div></div>
<div class="si" id="si"></div>
<lbl>Contraseña WiFi</lbl>
<input type="password" id="pw" placeholder="Contraseña" oninput="chk()" autocomplete="new-password">
<lbl style="margin-top:16px">URL del servidor</lbl>
<input type="text" id="srv" value="https://api.ojoia.com.do">
<button class="btn" id="b1" disabled onclick="save()">Conectar →</button>
</div>
<div id="okCard" class="card ok" style="display:none">
<div class="ico">✅</div><h2>¡Conectado!</h2><p>El dispositivo se reiniciará en 3 segundos<br>y comenzará a transmitir.</p>
</div>
<script>
var ss=null;
function sig(r){return r>=-55?'████':r>=-65?'███▁':r>=-75?'██▁▁':'█▁▁▁';}
function scan(){
  fetch('/scan').then(r=>r.json()).then(d=>{
    var el=document.getElementById('nets');el.innerHTML='';
    var n=d.networks||[];
    if(!n.length){el.innerHTML='<div style="padding:20px;text-align:center;color:var(--mu)">Sin redes</div>';return;}
    n.forEach((x,i)=>{
      var dv=document.createElement('div');dv.className='net';dv.dataset.i=i;
      dv.innerHTML='<span class="nm">'+(x.sec?'🔒 ':'')+x.ssid+'</span><span class="sg">'+sig(x.rssi)+'</span>';
      dv.onclick=function(){
        ss=n[this.dataset.i].ssid;
        document.querySelectorAll('.net').forEach(e=>e.classList.remove('sel'));
        this.classList.add('sel');
        document.getElementById('si').textContent='→ '+ss;
        chk();
      };
      el.appendChild(dv);
    });
  }).catch(()=>{document.getElementById('nets').innerHTML='<div style="padding:20px;text-align:center;color:#ff453a">Error buscando redes</div>';});
}
function chk(){
  var pw=document.getElementById('pw').value;
  var srv=document.getElementById('srv').value;
  document.getElementById('b1').disabled=!(ss&&pw.length>=4&&srv.startsWith('http'));
}
function save(){
  var b=document.getElementById('b1');b.disabled=true;b.textContent='Guardando...';
  var p=new URLSearchParams();
  p.append('ssid',ss);
  p.append('password',document.getElementById('pw').value);
  p.append('server_url',document.getElementById('srv').value);
  fetch('/save',{method:'POST',body:p,headers:{'Content-Type':'application/x-www-form-urlencoded'}})
  .then(r=>{if(!r.ok)throw 0;})
  .then(()=>{document.getElementById('setupCard').style.display='none';document.getElementById('okCard').style.display='block';setTimeout(()=>window.location.reload(),3000);})
  .catch(()=>{b.disabled=false;b.textContent='Conectar →';});
}
window.onload=scan;
</script></body></html>)RAW";

void setLED(uint8_t brightness) {
  ledCurrent = brightness;
  analogWrite(LED_PIN, brightness);
}

void syncNTP() {
  configTime(NTP_TZ_OFF, 0, NTP_SERVER, "time.cloudflare.com");
  Serial.print("[NTP] Sincronizando...");
  unsigned long t = millis();
  struct tm ti;
  while (!getLocalTime(&ti) && millis() - t < 10000) {
    delay(300);
    Serial.print(".");
  }
  ntpReady = getLocalTime(&ti);
  Serial.println(ntpReady ? " ✓" : " ✗ (sin NTP)");
}

