samuel0117-coder/ojoia-eva/ojoia-eva/ai_system/firmware_esp32_v6.cpp
String getTimestamp() {
  if (!ntpReady) return String(millis());
  struct tm ti;
  if (!getLocalTime(&ti)) return String(millis());
  char buf[32];
  strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S", &ti);
  return String(buf);
}

uint8_t avgBrightness(camera_fb_t* fb) {
  if (!fb || fb->len < 100) return 128;
  uint32_t sum = 0;
  int step = fb->len / 100;
  for (int i = 0; i < 100; i++) {
    sum += fb->buf[i * step];
  }
  return (uint8_t)(sum / 100);
}

void autoLED(camera_fb_t* fb) {
  if (!cfg.led_auto) return;
  uint8_t bright = avgBrightness(fb);
  if (bright < LIGHT_LOW_THRESH && ledCurrent == 0) {
    setLED(cfg.led_bright);
    Serial.printf("[LED] Auto ON (bright=%d)\n", bright);
  } else if (bright > LIGHT_HIGH_THRESH && ledCurrent > 0) {
    setLED(0);
    Serial.printf("[LED] Auto OFF (bright=%d)\n", bright);
  }
}

bool loadConfig() {
  prefs.begin(PREF_NS, true);
  bool ok  = prefs.getBool("ok", false);
  String s = prefs.getString("ssid", "");
  String p = prefs.getString("pw", "");
  String u = prefs.getString("srv_url", DEFAULT_SERVER_URL);
  prefs.end();
  if (ok && s.length() > 0) {
    strlcpy(ssid,      s.c_str(), sizeof(ssid));
    strlcpy(password,  p.c_str(), sizeof(password));
    strlcpy(serverUrl, u.c_str(), sizeof(serverUrl));
    return true;
  }
  return false;
}

bool saveConfig(const String& s, const String& p, const String& url) {
  prefs.begin(PREF_NS, false);
  prefs.putBool("ok", true);
  prefs.putString("ssid", s);
  prefs.putString("pw", p);
  prefs.putString("srv_url", url);
  prefs.end();
  return true;
}

void saveCamConfig() {
  prefs.begin(PREF_NS, false);
  prefs.putUInt("interval",    cfg.interval_ms);
  prefs.putUChar("quality",    cfg.quality);
  prefs.putUChar("framesize",  cfg.framesize);
  prefs.putBool("led_auto",    cfg.led_auto);
  prefs.putUChar("led_bright", cfg.led_bright);
  prefs.putBool("h_mirror",    cfg.h_mirror);
  prefs.putBool("v_flip",      cfg.v_flip);
  prefs.putBool("stream_all",  cfg.stream_always);
  prefs.end();
}

void loadCamConfig() {
  prefs.begin(PREF_NS, true);
  cfg.interval_ms   = prefs.getUInt("interval",    DEFAULT_INTERVAL_MS);
  cfg.quality       = prefs.getUChar("quality",    DEFAULT_QUALITY);
  cfg.framesize     = (framesize_t)prefs.getUChar("framesize", DEFAULT_FRAMESIZE);
  cfg.led_auto      = prefs.getBool("led_auto",    DEFAULT_LED_AUTO);
  cfg.led_bright    = prefs.getUChar("led_bright", DEFAULT_LED_BRIGHT);
  cfg.h_mirror      = prefs.getBool("h_mirror",    DEFAULT_H_MIRROR);
  cfg.v_flip        = prefs.getBool("v_flip",      DEFAULT_V_FLIP);
  cfg.stream_always = prefs.getBool("stream_all",  true);
  prefs.end();
  if (cfg.interval_ms < 500)   cfg.interval_ms = 500;
  if (cfg.interval_ms > 30000) cfg.interval_ms = 30000;
  if (cfg.quality < 4)         cfg.quality = 4;
  if (cfg.quality > 63)        cfg.quality = 63;
}

void generateID() {
  uint8_t mac[6];
  esp_read_mac(mac, ESP_MAC_WIFI_STA);
  snprintf(cameraID, sizeof(cameraID), "OJO-%02X%02X%02X", mac[3], mac[4], mac[5]);
}

void applyCameraSettings() {
  sensor_t* s = esp_camera_sensor_get();
  if (!s) return;
  s->set_framesize(s,  (framesize_t)cfg.framesize);
  s->set_quality(s,    cfg.quality);
  s->set_hmirror(s,    cfg.h_mirror ? 1 : 0);
  s->set_vflip(s,      cfg.v_flip   ? 1 : 0);
  s->set_brightness(s,   0);
  s->set_contrast(s,     0);
  s->set_saturation(s,   0);
  s->set_whitebal(s,     1);
  s->set_awb_gain(s,     1);
  s->set_wb_mode(s,      0);
  s->set_exposure_ctrl(s,1);
  s->set_aec2(s,         1);
  s->set_gain_ctrl(s,    1);
  s->set_agc_gain(s,     0);
  s->set_gainceiling(s, GAINCEILING_4X);
  s->set_bpc(s,          1);
  s->set_wpc(s,          1);
  s->set_raw_gma(s,      1);
  s->set_lenc(s,         1);
  s->set_dcw(s,          1);
  s->set_colorbar(s,     0);
  Serial.printf("[CAM] Ajustes: size=%d quality=%d mirror=%d flip=%d\n",
                cfg.framesize, cfg.quality, cfg.h_mirror, cfg.v_flip);
}

bool initCamera() {
  camera_config_t c = {};
  c.ledc_channel = LEDC_CHANNEL_0;
  c.ledc_timer   = LEDC_TIMER_0;
  c.pin_d0 = Y2_GPIO_NUM; c.pin_d1 = Y3_GPIO_NUM;
  c.pin_d2 = Y4_GPIO_NUM; c.pin_d3 = Y5_GPIO_NUM;
  c.pin_d4 = Y6_GPIO_NUM; c.pin_d5 = Y7_GPIO_NUM;
  c.pin_d6 = Y8_GPIO_NUM; c.pin_d7 = Y9_GPIO_NUM;
  c.pin_xclk  = XCLK_GPIO_NUM;
  c.pin_pclk  = PCLK_GPIO_NUM;
  c.pin_vsync = VSYNC_GPIO_NUM;
  c.pin_href  = HREF_GPIO_NUM;
  c.pin_sccb_sda = SIOD_GPIO_NUM;
  c.pin_sccb_scl = SIOC_GPIO_NUM;
  c.pin_pwdn  = PWDN_GPIO_NUM;
  c.pin_reset = RESET_GPIO_NUM;
  c.xclk_freq_hz  = 20000000;
  c.pixel_format  = PIXFORMAT_JPEG;
  c.frame_size    = (framesize_t)cfg.framesize;
  c.jpeg_quality  = cfg.quality;
  c.fb_count      = 2;

  if (esp_camera_init(&c) != ESP_OK) return false;

  for (int i = 0; i < 3; i++) {
    camera_fb_t* fb = esp_camera_fb_get();
    if (fb) esp_camera_fb_return(fb);
    delay(100);
  }
  applyCameraSettings();
  return true;
}

bool connectWiFi() {
  Serial.printf("[WiFi] Conectando a '%s'...\n", ssid);
  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);
  WiFi.setSleep(false);
  unsigned long t = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - t < 20000) {
    delay(300);
    Serial.print(".");
  }
  Serial.println();
  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("[WiFi] ✓ IP: %s\n", WiFi.localIP().toString().c_str());
    return true;
  }
  return false;
}

void startAP() {
  WiFi.disconnect(true);
  delay(200);
  WiFi.mode(WIFI_AP);
  delay(200);
  IPAddress apIP(192, 168, 4, 1);
  WiFi.softAPConfig(apIP, apIP, IPAddress(255, 255, 255, 0));
  String apName = "OjoIA-" + String(cameraID);
  WiFi.softAP(apName.c_str(), AP_PASSWORD);
  dns.start(53, "*", apIP);

  portalServer.on("/", HTTP_GET, []() {
    portalServer.send_P(200, "text/html", PORTAL_HTML);
  });
  portalServer.on("/scan", HTTP_GET, []() {
    if (WiFi.getMode() == WIFI_AP) WiFi.mode(WIFI_AP_STA);
    int n = WiFi.scanNetworks(false, false);
    String json = "{\"networks\":[";
    for (int i = 0; i < n; i++) {
      if (i) json += ",";
      String s = WiFi.SSID(i);
      s.replace("\"", "\\\"");
      json += "{\"ssid\":\"" + s + "\",\"rssi\":" + String(WiFi.RSSI(i)) +
              ",\"sec\":" + String(WiFi.encryptionType(i) != WIFI_AUTH_OPEN ? 1 : 0) + "}";
    }
    json += "]}";
    WiFi.scanDelete();
    WiFi.mode(WIFI_AP);
    portalServer.sendHeader("Access-Control-Allow-Origin", "*");
    portalServer.send(200, "application/json", json);
  });
  portalServer.on("/save", HTTP_POST, []() {
    String s   = portalServer.arg("ssid");
    String p   = portalServer.arg("password");
    String url = portalServer.arg("server_url");
    s.trim(); p.trim(); url.trim();
    if (s.isEmpty() || p.length() < 4 || !url.startsWith("http")) {
      portalServer.send(400, "text/plain", "Datos inválidos");
      return;
    }
    saveConfig(s, p, url);
    portalServer.send(200, "text/plain", "OK");
    portalServer.client().flush();
    delay(500);
    ESP.restart();
  });
  portalServer.onNotFound([]() {
    if (portalServer.uri() == "/scan" || portalServer.uri() == "/save") {
      portalServer.send(404);
      return;
    }
    portalServer.sendHeader("Location", "http://192.168.4.1/");
    portalServer.send(302);
  });
  portalServer.begin();
  Serial.printf("[AP] ✓ SSID: %s | Pass: %s\n", apName.c_str(), AP_PASSWORD);
}

void setupConfigServer() {
  configServer.on("/status", HTTP_GET, []() {
    String ts = getTimestamp();
    String json = "{";
    json += "\"camera_id\":\"" + String(cameraID) + "\",";
    json += "\"firmware\":\"v6.1\",";
    json += "\"timestamp\":\"" + ts + "\",";
    json += "\"wifi_rssi\":" + String(WiFi.RSSI()) + ",";
    json += "\"interval_ms\":" + String(cfg.interval_ms) + ",";
    json += "\"quality\":" + String(cfg.quality) + ",";
    json += "\"framesize\":" + String(cfg.framesize) + ",";
    json += "\"led_auto\":" + String(cfg.led_auto ? "true" : "false") + ",";
    json += "\"led_bright\":" + String(cfg.led_bright) + ",";
    json += "\"led_current\":" + String(ledCurrent) + ",";
    json += "\"h_mirror\":" + String(cfg.h_mirror ? "true" : "false") + ",";
    json += "\"v_flip\":" + String(cfg.v_flip ? "true" : "false") + ",";
    json += "\"stream_always\":" + String(cfg.stream_always ? "true" : "false") + ",";
    json += "\"ntp_ready\":" + String(ntpReady ? "true" : "false");
    json += "}";
    configServer.sendHeader("Access-Control-Allow-Origin", "*");
    configServer.send(200, "application/json", json);
  });

