samuel0117-coder/ojoia-eva/ojoia-eva/ai_system/firmware_esp32_v6.cpp
  configServer.on("/config", HTTP_POST, []() {
    configServer.sendHeader("Access-Control-Allow-Origin", "*");
    if (!configServer.hasArg("plain")) {
      configServer.send(400, "application/json", "{\"error\":\"no body\"}");
      return;
    }
    String body = configServer.arg("plain");
    auto getInt = [&](const char* key, int def) -> int {
      String k = "\"" + String(key) + "\":";
      int pos = body.indexOf(k);
      if (pos < 0) return def;
      pos += k.length();
      while (pos < (int)body.length() && (body[pos] == ' ')) pos++;
      int end = pos;
      while (end < (int)body.length() && body[end] != ',' && body[end] != '}') end++;
      return body.substring(pos, end).toInt();
    };
    auto getBool = [&](const char* key, bool def) -> bool {
      String k = "\"" + String(key) + "\":";
      int pos = body.indexOf(k);
      if (pos < 0) return def;
      pos += k.length();
      while (pos < (int)body.length() && (body[pos] == ' ')) pos++;
      return body.substring(pos, pos + 4) == "true";
    };

    bool changed    = false;
    bool reinitCam  = false;

    int q = getInt("quality", -1);
    if (q >= 4 && q <= 63 && q != cfg.quality) { cfg.quality = q; changed = true; }

    int fs = getInt("framesize", -1);
    if (fs >= 0 && fs <= 13 && fs != cfg.framesize) { cfg.framesize = fs; changed = true; reinitCam = true; }

    int iv = getInt("interval_ms", -1);
    if (iv >= 200 && iv <= 30000 && (uint32_t)iv != cfg.interval_ms) { cfg.interval_ms = iv; changed = true; }

    int lb = getInt("led_bright", -1);
    if (lb >= 0 && lb <= 255 && lb != cfg.led_bright) { cfg.led_bright = lb; changed = true; }

    if (body.indexOf("\"led_auto\"") >= 0) {
      bool la = getBool("led_auto", cfg.led_auto);
      if (la != cfg.led_auto) { cfg.led_auto = la; changed = true; }
    }
    if (body.indexOf("\"h_mirror\"") >= 0) {
      bool hm = getBool("h_mirror", cfg.h_mirror);
      if (hm != cfg.h_mirror) { cfg.h_mirror = hm; changed = true; }
    }
    if (body.indexOf("\"v_flip\"") >= 0) {
      bool vf = getBool("v_flip", cfg.v_flip);
      if (vf != cfg.v_flip) { cfg.v_flip = vf; changed = true; }
    }
    if (body.indexOf("\"stream_always\"") >= 0) {
      bool sa = getBool("stream_always", cfg.stream_always);
      if (sa != cfg.stream_always) { cfg.stream_always = sa; changed = true; }
    }

    if (body.indexOf("\"led_on\":true") >= 0) {
      setLED(cfg.led_bright);
    } else if (body.indexOf("\"led_on\":false") >= 0) {
      setLED(0);
    }

    if (changed) {
      saveCamConfig();
      if (reinitCam) {
        sensor_t* s = esp_camera_sensor_get();
        if (s) s->set_framesize(s, (framesize_t)cfg.framesize);
      }
      applyCameraSettings();
      Serial.println("[CONFIG] ✓ Actualizado desde app");
    }

    configServer.send(200, "application/json",
      "{\"ok\":true,\"camera_id\":\"" + String(cameraID) + "\"}");
  });

  configServer.on("/snapshot", HTTP_GET, []() {
    camera_fb_t* fb = esp_camera_fb_get();
    if (!fb) {
      configServer.send(503, "text/plain", "Camera error");
      return;
    }
    configServer.sendHeader("Access-Control-Allow-Origin", "*");
    configServer.sendHeader("X-Camera-Id", cameraID);
    configServer.sendHeader("X-Timestamp", getTimestamp());
    configServer.send_P(200, "image/jpeg", (const char*)fb->buf, fb->len);
    esp_camera_fb_return(fb);
  });

  configServer.onNotFound([]() {
    if (configServer.method() == HTTP_OPTIONS) {
      configServer.sendHeader("Access-Control-Allow-Origin", "*");
      configServer.sendHeader("Access-Control-Allow-Methods", "GET,POST,OPTIONS");
      configServer.sendHeader("Access-Control-Allow-Headers", "*");
      configServer.send(204);
    } else {
      configServer.send(404);
    }
  });

  configServer.begin();
  Serial.printf("[API] Config server en http://%s:81\n", WiFi.localIP().toString().c_str());
}

void pollServerConfig() {
  HTTPClient http;
  String url = String(serverUrl) + "/camera/config/" + String(cameraID);
  http.begin(url);
  http.addHeader("X-Camera-Id", cameraID);
  http.setTimeout(5000);
  int code = http.GET();

  if (code == 200) {
    String body = http.getString();
    http.end();

    auto getInt = [&](const char* key, int def) -> int {
      String k = "\"" + String(key) + "\":";
      int pos = body.indexOf(k);
      if (pos < 0) return def;
      pos += k.length();
      while (pos < (int)body.length() && (body[pos] == ' ')) pos++;
      int end = pos;
      while (end < (int)body.length() && body[end] != ',' && body[end] != '}') end++;
      return body.substring(pos, end).toInt();
    };
    auto getBool = [&](const char* key, bool def) -> bool {
      String k = "\"" + String(key) + "\":";
      int pos = body.indexOf(k);
      if (pos < 0) return def;
      pos += k.length();
      while (pos < (int)body.length() && (body[pos] == ' ')) pos++;
      return body.substring(pos, pos + 4) == "true";
    };

    bool changed = false;
    int q = getInt("quality", -1);
    if (q >= 4 && q <= 63 && q != cfg.quality) { cfg.quality = q; changed = true; }
    int iv = getInt("interval_ms", -1);
    if (iv >= 200 && iv <= 30000 && (uint32_t)iv != cfg.interval_ms) { cfg.interval_ms = iv; changed = true; }
    int lb = getInt("led_bright", -1);
    if (lb >= 0 && lb <= 255 && lb != cfg.led_bright) { cfg.led_bright = lb; changed = true; }
    if (body.indexOf("\"led_auto\"") >= 0) {
      bool la = getBool("led_auto", cfg.led_auto);
      if (la != cfg.led_auto) { cfg.led_auto = la; changed = true; }
    }
    if (body.indexOf("\"h_mirror\"") >= 0) {
      bool hm = getBool("h_mirror", cfg.h_mirror);
      if (hm != cfg.h_mirror) { cfg.h_mirror = hm; changed = true; }
    }
    if (body.indexOf("\"v_flip\"") >= 0) {
      bool vf = getBool("v_flip", cfg.v_flip);
      if (vf != cfg.v_flip) { cfg.v_flip = vf; changed = true; }
    }

    if (changed) {
      saveCamConfig();
      applyCameraSettings();
      Serial.println("[CONFIG] ✓ Config actualizada desde servidor");
    }
  } else {
    http.end();
    if (code != 0) {
      Serial.printf("[CONFIG] Server response: %d\n", code);
    }
  }
}

void announceDevice() {
  static unsigned long lastAnnounceAttempt = 0;
  if (announced && millis() - lastAnnounceAttempt < 300000) return;

  lastAnnounceAttempt = millis();

  HTTPClient http;
  String url = String(serverUrl) + "/devices/announce";
  http.begin(url);
  http.addHeader("Content-Type", "application/json");
  http.setTimeout(5000);

  String ip = WiFi.localIP().toString();
  String ts = getTimestamp();
  String payload = "{\"camera_id\":\"" + String(cameraID) +
                   "\",\"firmware_id\":\"" + String(cameraID) +
                   "\",\"ip\":\"" + ip +
                   "\",\"local_config_url\":\"http://" + ip + ":81\"" +
                   ",\"firmware\":\"v6.1\"" +
                   ",\"rssi\":" + String(WiFi.RSSI()) +
                   ",\"uptime\":" + String(millis() / 1000) +
                   ",\"timestamp\":\"" + ts + "\"}";

