samuel0117-coder/ojoia-eva/ojoia-eva/ai_system/firmware_esp32_v6.cpp
  int code = http.POST(payload);
  http.end();

  if (code >= 200 && code < 300) {
    Serial.println("[ANNOUNCE] ✓ Registrado");
    announced = true;
  } else {
    Serial.printf("[ANNOUNCE] ✗ HTTP %d (reintentando)\n", code);
    announced = false;
  }
}

bool sendFrame(uint8_t* buf, size_t len) {
  String urlStr = String(serverUrl);
  bool isHttps  = urlStr.startsWith("https://");
  String hostPort = urlStr.substring(isHttps ? 8 : 7);
  int slash = hostPort.indexOf('/');
  if (slash > 0) hostPort = hostPort.substring(0, slash);

  String host = hostPort;
  int port = isHttps ? 443 : 80;
  int colon = hostPort.indexOf(':');
  if (colon > 0) {
    host = hostPort.substring(0, colon);
    port = hostPort.substring(colon + 1).toInt();
  }

  WiFiClientSecure secureClient;
  WiFiClient plainClient;
  WiFiClient* client = isHttps ? &secureClient : &plainClient;

  if (isHttps) {
    secureClient.setInsecure();
  }

  if (!client->connect(host.c_str(), port)) {
    Serial.printf("[TX] ✗ No connection to %s:%d\n", host.c_str(), port);
    return false;
  }

  if (currentSessionId.length() == 0) {
    currentSessionId = String(cameraID) + "-" + String(millis());
  }

  String ts = getTimestamp();
  String path = "/ingest/frame";

  client->printf(
    "POST %s HTTP/1.1\r\n"
    "Host: %s\r\n"
    "X-Camera-Id: %s\r\n"
    "X-Session-Id: %s\r\n"
    "X-Timestamp: %s\r\n"
    "X-Firmware: v6.1\r\n"
    "X-Quality: %d\r\n"
    "X-Framesize: %d\r\n"
    "X-Led: %d\r\n"
    "X-Uptime: %lu\r\n"
    "Content-Type: image/jpeg\r\n"
    "Content-Length: %u\r\n"
    "Connection: close\r\n\r\n",
    path.c_str(), host.c_str(),
    cameraID, currentSessionId.c_str(),
    ts.c_str(),
    cfg.quality, cfg.framesize, ledCurrent,
    millis() / 1000,
    len
  );

  size_t sent = client->write(buf, len);

  unsigned long t = millis();
  while (!client->available() && millis() - t < 5000) delay(10);

  String resp = "";
  if (client->available()) {
    resp = client->readStringUntil('\n');
    while (client->available()) client->read();
  }
  client->stop();

  bool ok = (sent == len && resp.startsWith("HTTP/1.1 2"));
  if (ok) {
    Serial.printf("[TX] ✓ %u bytes | %s\n", len, ts.c_str());
  } else {
    Serial.printf("[TX] ✗ sent=%u/%u | resp: %s\n", sent, len, resp.c_str());
  }
  return ok;
}

void setup() {
  pinMode(LED_PIN, OUTPUT);
  analogWrite(LED_PIN, 0);
  Serial.begin(115200);
  delay(500);
  Serial.println("\n═══ OjoIA ESP32-CAM v6.1 ═══");

  esp_task_wdt_init(WATCHDOG_SECS, true);
  esp_task_wdt_add(NULL);

  generateID();
  loadCamConfig();
  configured = loadConfig();

  if (configured) {
    if (connectWiFi()) {
      syncNTP();
      cameraOK = initCamera();
      if (!cameraOK) {
        Serial.println("[CAM] ✗ Fallo al inicializar");
      } else {
        Serial.println("[CAM] ✓ Lista");
        setupConfigServer();
      }
    } else {
      Serial.println("[WiFi] ✗ Fallo, iniciando AP...");
      startAP();
    }
  } else {
    Serial.println("[CONFIG] Sin configuración, iniciando AP...");
    startAP();
  }

  Serial.printf("[BOOT] ID: %s | URL: %s | Intervalo: %dms\n",
                cameraID, serverUrl, cfg.interval_ms);
}

void loop() {
  esp_task_wdt_reset();

  if (!configured) {
    portalServer.handleClient();
    dns.processNextRequest();
    delay(5);
    return;
  }

  if (WiFi.status() != WL_CONNECTED) {
    if (wifiLostAt == 0) wifiLostAt = millis();
    if (millis() - wifiLostAt > WIFI_RECONNECT_MS) {
      WiFi.reconnect();
      delay(1000);
      if (WiFi.status() == WL_CONNECTED) {
        wifiLostAt = 0;
        announced  = false;
        Serial.println("[WiFi] ✓ Reconectado");
      }
    }
    if (wifiLostAt > 0 && millis() - wifiLostAt > WIFI_RESTART_MS) {
      Serial.println("[WiFi] Timeout → reiniciando");
      ESP.restart();
    }
    delay(100);
    return;
  }
  wifiLostAt = 0;

  configServer.handleClient();

  if (!announced) {
    announceDevice();
    return;
  }

  if (millis() - lastConfigPoll > CONFIG_POLL_MS) {
    lastConfigPoll = millis();
    pollServerConfig();
  }

  if (!cameraOK) { delay(500); return; }

  if (millis() - lastSend < cfg.interval_ms) {
    delay(20);
    return;
  }

  camera_fb_t* fb = esp_camera_fb_get();
  if (!fb) {
    Serial.println("[CAM] ✗ Fallo captura");
    delay(100);
    return;
  }

  autoLED(fb);
  bool ok = sendFrame(fb->buf, fb->len);
  esp_camera_fb_return(fb);

  if (ok) {
    lastSend = millis();
  } else {
    delay(500);
  }
}
